cylinder2D_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            patch;
        nFaces          550;
        startFace       169150;
    }
    bottom
    {
        type            patch;
        nFaces          550;
        startFace       169700;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       170250;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       170350;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          85000;
        startFace       170450;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          85000;
        startFace       255450;
    }
    cylinder
    {
        type            patch;
        nFaces          400;
        startFace       340450;
    }
)

// ************************************************************************* //
